// Задание 1. Создай функцию, которая принимает произвольное количество чисел и возвращает их среднее значение;


// Задание 2. Создай функцию, которая принимает объект с информацией о пользователе (имя, возраст, страна)
//  и возвращает строку с этой информацией, используя деструктуризацию;


// Задание 3. Создай объект с вложенными объектами и массивами. 
// Используй деструктуризацию, чтобы извлечь несколько значений на разных уровнях вложенности;


// Задание 4. Используй оператор `spread` для создания нового массива, который включает все элементы исходного массива 
// и добавляет несколько новых элементов в начале и в конце;


// Задание 5. Используй оператор `rest` для создания функции, которая принимает объект с параметрами и 
// возвращает новый объект без одного указанного параметра.