// ЗАДАНИЕ 1
/*  Создай переменные для хранения своего города и температуры воздуха в нем на сегодняшний день. 
Используй эти переменные для вывода информации о своем городе в консоль;*/

const myCity = 'Москва'; //Создали переменную с городом//
let temperature = 18; //Создали переменную с температурой//
console.log(`Мой город: ${myCity}`);
console.log(`Температура воздуха сегодня: ${temperature}°C`);//Вывели переменные в консоль//

// ЗАДАНИЕ 2
/*Напиши выражение, которое вычисляет сумму двух чисел и умножает результат на третье число. 
Выведи результат в консоль;*/

let firstNumber = 7; // вводим числа//
let secondNumber = 15;
let thirdNumber = 2;
let result = (firstNumber + secondNumber) * thirdNumber; // выражение для посчета суммы и умножения//
console.log(`(${firstNumber} + ${secondNumber}) * ${thirdNumber}`); // выведет само выражение текстом //
console.log(result); // выведет результат выражения//